Тест_ЗУП_31_КОРП/src/Catalogs/ШаблоныПроизвольныхКадровыхПриказов/ШаблоныПроизвольныхКадровыхПриказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПроизвольныхКадровыхПриказов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НесколькоСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетРуководитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетГлавныйБухгалтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетКассир</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетРуководительКадровойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписываетБухгалтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеПечатныеФормы</name>
    <attributes>
      <name>ПечатнаяФорма</name>
      <type>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Documents/ПроизвольныйКадровыйПриказ/ПроизвольныйКадровыйПриказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизвольныйКадровыйПриказ</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныПроизвольныхКадровыхПриказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьКассира</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительКадровойСлужбы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителяКадровойСлужбы</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Бухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьБухгалтера</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияРеквизитов</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыПроизвольныхКадровыхПриказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыПроизвольныхКадровыхПриказов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/ChartsOfCharacteristicTypes/РеквизитыПроизвольныхКадровыхПриказов/РеквизитыПроизвольныхКадровыхПриказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>РеквизитыПроизвольныхКадровыхПриказов</name>
  <type>
    <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    <types>CatalogRef.ПричиныОтклоненияКандидатов</types>
    <types>CatalogRef.УченыеСтепени</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ПрофессииРабочих</types>
    <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    <types>CatalogRef.ВидыДоходовПоСтраховымВзносам</types>
    <types>CatalogRef.СоставыВоеннослужащих</types>
    <types>CatalogRef.УровниКомпетенцийПерсонала</types>
    <types>CatalogRef.КритерииОценкиПозицийШтатногоРасписания</types>
    <types>CatalogRef.Работодатели</types>
    <types>CatalogRef.ВидыСтажа</types>
    <types>CatalogRef.Должности</types>
    <types>CatalogRef.ОснованияИсчисляемогоСтраховогоСтажа</types>
    <types>CatalogRef.ОсобыеУсловияТрудаПФР</types>
    <types>CatalogRef.СтатусыНалогоплательщиковПоНДФЛ</types>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Грейды</types>
    <types>CatalogRef.ВидыКадровогоРезерва</types>
    <types>CatalogRef.СпособыВыплатыЗарплаты</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.СтепениРодстваФизическихЛиц</types>
    <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    <types>CatalogRef.ПодразделенияОрганизаций</types>
    <types>CatalogRef.ВидыДоходовНДФЛ</types>
    <types>CatalogRef.Кандидаты</types>
    <types>CatalogRef.ПричиныОтсутствияСотрудников</types>
    <types>CatalogRef.РешенияАттестационныхКомиссий</types>
    <types>CatalogRef.ТерриториальныеУсловияПФР</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ТерриторииВыполненияРабот</types>
    <types>Boolean</types>
    <types>CatalogRef.ВидыДокументовОбОбразовании</types>
    <types>CatalogRef.СтатьиРасходовЗарплата</types>
    <types>CatalogRef.ВидыПрочихДоходовФизическихЛиц</types>
    <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    <types>CatalogRef.ПричиныОткрытияВакансий</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.СтруктураЦелей</types>
    <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    <types>CatalogRef.ОснованияДосрочногоНазначенияПенсии</types>
    <types>CatalogRef.ВидыРаботСотрудников</types>
    <types>CatalogRef.ШтатноеРасписание</types>
    <types>CatalogRef.ВидыВычетовНДФЛ</types>
    <types>CatalogRef.Награды</types>
    <types>ChartOfCalculationTypesRef.Начисления</types>
    <types>String</types>
    <types>CatalogRef.РазрядыКатегорииДолжностей</types>
    <types>CatalogRef.ОснованияУвольнения</types>
    <types>CatalogRef.УченыеЗвания</types>
    <types>CatalogRef.СпособыОкругленияПриРасчетеЗарплаты</types>
    <types>Date</types>
    <types>CatalogRef.СтраныМира</types>
    <types>ChartOfCalculationTypesRef.Удержания</types>
    <types>Number</types>
    <types>CatalogRef.ВидыОтпусков</types>
    <types>CatalogRef.УсловияТруда</types>
    <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    <types>CatalogRef.КадровыйРезерв</types>
    <types>CatalogRef.ОсобыеУсловияТрудаДляСЗВКПФР</types>
    <types>CatalogRef.КомпетенцииПерсонала</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ЗванияГражданскогоВоинскогоУчета</types>
    <types>CatalogRef.ОснованияЗаключенияСрочныхТрудовыхДоговоров</types>
    <types>CatalogRef.ОбразованиеФизическихЛиц</types>
    <types>CatalogRef.МероприятияОценкиПерсонала</types>
    <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    <types>CatalogRef.ВидыАттестацийСотрудников</types>
    <types>CatalogRef.ПрочиеРасходы</types>
    <types>CatalogRef.УчебныеЗаведения</types>
    <types>CatalogRef.ОснованияДосрочногоНазначенияПенсииДляСЗВК</types>
    <types>CatalogRef.СостояниеВБраке</types>
    <types>CatalogRef.ТарифныеСетки</types>
    <types>CatalogRef.МероприятияОбученияРазвития</types>
    <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
    <numberQualifiers>
      <precision>17</precision>
      <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныПроизвольныхКадровыхПриказов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноДляЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВТабличнойЧасти</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

Тест_ЗУП_31_КОРП/src/Catalogs/ШаблоныПроизвольныхКадровыхПриказов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не Параметры.Ключ.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыПроизвольныхКадровыхПриказов.Ссылка,
		|	РеквизитыПроизвольныхКадровыхПриказов.Наименование,
		|	РеквизитыПроизвольныхКадровыхПриказов.ТипЗначения,
		|	РеквизитыПроизвольныхКадровыхПриказов.ОбязательноДляЗаполнения,
		|	РеквизитыПроизвольныхКадровыхПриказов.РеквизитУпорядочивания КАК РеквизитУпорядочивания
		|ИЗ
		|	ПланВидовХарактеристик.РеквизитыПроизвольныхКадровыхПриказов КАК РеквизитыПроизвольныхКадровыхПриказов
		|ГДЕ
		|	РеквизитыПроизвольныхКадровыхПриказов.Шаблон = &Шаблон
		|	И НЕ РеквизитыПроизвольныхКадровыхПриказов.ИспользуетсяВТабличнойЧасти 
		|	И НЕ РеквизитыПроизвольныхКадровыхПриказов.ВАрхиве
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитУпорядочивания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеквизитыПроизвольныхКадровыхПриказов.Ссылка,
		|	РеквизитыПроизвольныхКадровыхПриказов.Наименование,
		|	РеквизитыПроизвольныхКадровыхПриказов.ТипЗначения,
		|	РеквизитыПроизвольныхКадровыхПриказов.ОбязательноДляЗаполнения,
		|	РеквизитыПроизвольныхКадровыхПриказов.РеквизитУпорядочивания КАК РеквизитУпорядочивания
		|ИЗ
		|	ПланВидовХарактеристик.РеквизитыПроизвольныхКадровыхПриказов КАК РеквизитыПроизвольныхКадровыхПриказов
		|ГДЕ
		|	РеквизитыПроизвольныхКадровыхПриказов.Шаблон = &Шаблон
		|	И РеквизитыПроизвольныхКадровыхПриказов.ИспользуетсяВТабличнойЧасти 
		|	И НЕ РеквизитыПроизвольныхКадровыхПриказов.ВАрхиве
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеквизитУпорядочивания";
		
		Запрос.УстановитьПараметр("Шаблон", Объект.Ссылка);
		
		Результат = Запрос.ВыполнитьПакет();
		
		РеквизитыДокумента.Загрузить(Результат[0].Выгрузить());
		
		РеквизитыСпискаСотрудников.Загрузить(Результат[1].Выгрузить());		
		
	КонецЕсли;
	
	НесколькоСотрудников = ?(Объект.НесколькоСотрудников, 1, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроизвольныйКадровыйПриказЗначенияРеквизитов.Ссылка КАК Документ,
	|	ПроизвольныйКадровыйПриказЗначенияРеквизитов.Реквизит КАК Реквизит,
	|	ПроизвольныйКадровыйПриказЗначенияРеквизитов.Ссылка.Представление
	|ИЗ
	|	Документ.ПроизвольныйКадровыйПриказ.ЗначенияРеквизитов КАК ПроизвольныйКадровыйПриказЗначенияРеквизитов
	|ГДЕ
	|	ПроизвольныйКадровыйПриказЗначенияРеквизитов.Ссылка.Шаблон = &Шаблон
	|	И ПроизвольныйКадровыйПриказЗначенияРеквизитов.Реквизит В(&СписокРеквизитов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реквизит,
	|	Документ
	|ИТОГИ ПО
	|	Реквизит
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроизвольныйКадровыйПриказЗначенияРеквизитов.Ссылка КАК Документ,
	|	ПроизвольныйКадровыйПриказЗначенияРеквизитов.Реквизит КАК Реквизит,
	|	ПроизвольныйКадровыйПриказЗначенияРеквизитов.Ссылка.Представление
	|ИЗ
	|	Документ.ПроизвольныйКадровыйПриказ.ЗначенияРеквизитов КАК ПроизвольныйКадровыйПриказЗначенияРеквизитов
	|ГДЕ
	|	ПроизвольныйКадровыйПриказЗначенияРеквизитов.Ссылка.Шаблон = &Шаблон
	|	И НЕ ПроизвольныйКадровыйПриказЗначенияРеквизитов.Реквизит В (&СписокРеквизитов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реквизит,
	|	Документ
	|ИТОГИ ПО
	|	Реквизит
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроизвольныйКадровыйПриказ.Представление КАК Представление,
	|	ПроизвольныйКадровыйПриказ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПроизвольныйКадровыйПриказ КАК ПроизвольныйКадровыйПриказ
	|ГДЕ
	|	ПроизвольныйКадровыйПриказ.Шаблон = &Шаблон
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Шаблон", Объект.Ссылка);
	Запрос.УстановитьПараметр("СписокРеквизитов", УдаленныеРеквизиты);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаУдаленныеРеквизиты = Результат[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУдаленныеРеквизиты.Следующий() Цикл
		
		ТекстОшибки = "";
		
		УдаляемыйРеквизит = ВыборкаУдаленныеРеквизиты.Реквизит;
		
		ВыборкаДокумент = ВыборкаУдаленныеРеквизиты.Выбрать();
		
		КоличествоДокументовВОшибке = 0;
		ТекстОшибкиДокументов = "";
		
		Пока ВыборкаДокумент.Следующий() Цикл
			
			КоличествоДокументовВОшибке = КоличествоДокументовВОшибке + 1;
			Если КоличествоДокументовВОшибке > 2 Тогда
				СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекстОшибкиДокументов, 2);
				ТекстОшибкиДокументов = ТекстОшибкиДокументов + " и других ";
				Прервать;
			КонецЕсли;
			ТекстОшибкиДокументов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'") + ", ",
				ТекстОшибкиДокументов, ВыборкаДокумент.Представление);
		КонецЦикла;
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В документ%1 %2'"),
			?(КоличествоДокументовВОшибке > 1, "ах", "е"), ТекстОшибкиДокументов);
			
		ТекстОшибки = ТекстОшибки + НСтр("ru = 'используется удаляемый реквизит:'") + УдаляемыйРеквизит;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, , , Отказ);
	
	КонецЦикла; 	
	
	ВыборкаРеквизиты = Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРеквизиты.Следующий() Цикл
		
		ТекстОшибки = "";
		
		Реквизит = ВыборкаРеквизиты.Реквизит;
		
		ОписаниеРеквизитаНаФорме = НайтиРеквизит(Реквизит);
		
		Если ОписаниеРеквизитаНаФорме.ТипЗначения <> Реквизит.ТипЗначения Тогда
					
			ВыборкаДокумент = ВыборкаРеквизиты.Выбрать();
			
			КоличествоДокументовВОшибке = 0;
			ТекстОшибкиДокументов = "";
			
			Пока ВыборкаДокумент.Следующий() Цикл
				
				КоличествоДокументовВОшибке = КоличествоДокументовВОшибке + 1;
				Если КоличествоДокументовВОшибке > 2 Тогда
					СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекстОшибкиДокументов, 2);
					ТекстОшибкиДокументов = ТекстОшибкиДокументов + " и других ";
					Прервать;
				КонецЕсли;
				ТекстОшибкиДокументов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'") + ", ",
					ТекстОшибкиДокументов, ВыборкаДокумент.Представление);
			КонецЦикла;
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В документ%1 %2'"),
				?(КоличествоДокументовВОшибке > 1, "ах", "е"), ТекстОшибкиДокументов);
				
			ТекстОшибки = ТекстОшибки + НСтр("ru = 'используется реквизит:'") + Реквизит +  НСтр("ru = '. Изменение типа значения невозможно.'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, , , Отказ);
			
		КонецЕсли;	
			
	КонецЦикла; 
	
	Если Объект.Ссылка.НесколькоСотрудников <> Объект.НесколькоСотрудников 
		И Не Объект.НесколькоСотрудников Тогда
		
		ВыборкаДокументы = Результат[2].Выбрать();
		
		КоличествоДокументовВОшибке = 0;
		ТекстОшибкиДокументов = "";
		ТекстОшибки = "";

		Пока ВыборкаДокументы.Следующий() Цикл
							
			КоличествоДокументовВОшибке = КоличествоДокументовВОшибке + 1;
			Если КоличествоДокументовВОшибке > 2 Тогда
				СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекстОшибкиДокументов, 2);
				ТекстОшибкиДокументов = ТекстОшибкиДокументов + " и других ";
				Прервать;
			КонецЕсли;
			ТекстОшибкиДокументов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2'") + ", ",
				ТекстОшибкиДокументов, ВыборкаДокументы.Представление);
							
		КонецЦикла; 	
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В документ%1 %2'"),
				?(КоличествоДокументовВОшибке > 1, "ах", "е"), ТекстОшибкиДокументов);

		ТекстОшибки = ТекстОшибки + НСтр("ru = 'используется несколько сотрудников'");
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, , , Отказ);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьРеквизитНесколькоСотрудников();
		
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Индекс = 1;
	
	Для Каждого СтрокаТЗ Из РеквизитыДокумента Цикл
		
		Если Не (ЗначениеЗаполнено(СтрокаТЗ.Наименование) И ЗначениеЗаполнено(СтрокаТЗ.ТипЗначения)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			РеквизитОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
		Иначе
			РеквизитОбъект = ПланыВидовХарактеристик.РеквизитыПроизвольныхКадровыхПриказов.СоздатьЭлемент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(РеквизитОбъект, СтрокаТЗ);
		
		РеквизитОбъект.РеквизитУпорядочивания 	 	= Индекс;
		РеквизитОбъект.ИспользуетсяВТабличнойЧасти 	= Ложь;
		РеквизитОбъект.Шаблон						= ТекущийОбъект.Ссылка;
		
		РеквизитОбъект.Записать();			
		
		СтрокаТЗ.Ссылка = РеквизитОбъект.Ссылка;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Индекс = 1;
	
	Для Каждого СтрокаТЗ Из РеквизитыСпискаСотрудников Цикл
		
		Если Не (ЗначениеЗаполнено(СтрокаТЗ.Наименование) И ЗначениеЗаполнено(СтрокаТЗ.ТипЗначения)) Тогда
			Продолжить;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			РеквизитОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
		Иначе
			РеквизитОбъект = ПланыВидовХарактеристик.РеквизитыПроизвольныхКадровыхПриказов.СоздатьЭлемент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(РеквизитОбъект, СтрокаТЗ);
		
		РеквизитОбъект.РеквизитУпорядочивания 		= Индекс;
		РеквизитОбъект.ИспользуетсяВТабличнойЧасти 	= Истина;
		РеквизитОбъект.Шаблон						= ТекущийОбъект.Ссылка;
		
		РеквизитОбъект.Записать();			
		
		СтрокаТЗ.Ссылка = РеквизитОбъект.Ссылка;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Если ТипЗнч(УдаленныеРеквизиты) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Реквизит Из УдаленныеРеквизиты Цикл
			УстановитьПризнакВАрхивеРеквизиту(Реквизит);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура("Ссылка, Наименование, Представление, Родитель");
	ПараметрыОповещения.Ссылка = Объект.Ссылка;
	ПараметрыОповещения.Наименование = Объект.Наименование;
	ПараметрыОповещения.Представление = Объект.Наименование;
	ПараметрыОповещения.Родитель = Объект.Родитель;
	
	Оповестить("ИзмененВидДокументовПроизвольныйКадровыйПриказ", ПараметрыОповещения);
	
	ОбновитьИнтерфейс();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НесколькоСотрудниковПриИзменении(Элемент)
	
	УстановитьРеквизитНесколькоСотрудников();
	
	ОбновитьЭлементыФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПодразделениеПриИзменении(Элемент)
	
	Объект.ПроверятьЗаполнениеПодразделения = Ложь;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизитыДокумента

&НаКлиенте
Процедура РеквизитыДокументаПриАктивизацииПоля(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "РеквизитыДокументаТипЗначения" Тогда
		Элемент.ТекущийЭлемент.ДоступныеТипы = ДоступныеТипы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыДокументаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыДокументаПередНачаломИзменения(Элемент, Отказ)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыДокументаПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
		ДобавитьВМассивУдаленных(ТекДанные.Ссылка);
	КонецЕсли;
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыДокументаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.Ссылка = ПредопределенноеЗначение("ПланВидовХарактеристик.РеквизитыПроизвольныхКадровыхПриказов.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизитыСпискаСотрудников

&НаКлиенте
Процедура РеквизитыСпискаСотрудниковПриАктивизацииПоля(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "РеквизитыСпискаСотрудниковТипЗначения" Тогда
		Элемент.ТекущийЭлемент.ДоступныеТипы = ДоступныеТипы();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСпискаСотрудниковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСпискаСотрудниковПередНачаломИзменения(Элемент, Отказ)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСпискаСотрудниковПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
		ДобавитьВМассивУдаленных(ТекДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыСпискаСотрудниковПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.Ссылка = ПредопределенноеЗначение("ПланВидовХарактеристик.РеквизитыПроизвольныхКадровыхПриказов.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатныеФормы(Команда)
		
	ПечатныеФормы = Новый Массив;
	Для Каждого СтрокаТабличнойЧасти Из Объект.ВнешниеПечатныеФормы Цикл
		ПечатныеФормы.Добавить(СтрокаТабличнойЧасти.ПечатнаяФорма);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("Ссылка, ПечатныеФормы", Объект.Ссылка, ПечатныеФормы);
	Оповещение = Новый ОписаниеОповещения("ПечатныеФормыЗавершение", ЭтотОбъект);	
	ОткрытьФорму("Справочник.ШаблоныПроизвольныхКадровыхПриказов.Форма.ПечатныеФормы", ПараметрыФормы, ЭтаФорма, , , , 
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ГруппаТаблицаРеквизитыСпискаСотрудников.Доступность = Объект.НесколькоСотрудников;
	Элементы.ПроверятьЗаполнениеПодразделения.Доступность = Объект.ПоказыватьПодразделение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатныеФормыЗавершение(ПечатныеФормы, ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(ПечатныеФормы) = Тип("Массив") Тогда
		Объект.ВнешниеПечатныеФормы.Очистить();
		Для Каждого ПечатнаяФорма Из ПечатныеФормы Цикл
			НоваяСтрока = Объект.ВнешниеПечатныеФормы.Добавить();
			НоваяСтрока.ПечатнаяФорма = ПечатнаяФорма;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеТипы()
	
	НовыйЭлемент = ПланыВидовХарактеристик.РеквизитыПроизвольныхКадровыхПриказов.СоздатьЭлемент();
	Возврат НовыйЭлемент.ТипЗначения;
	
КонецФункции

&НаСервере
Процедура УстановитьПризнакВАрхивеРеквизиту(Ссылка)
	
	РеквизитОбъект = Ссылка.ПолучитьОбъект();
	РеквизитОбъект.ВАрхиве = Истина;
	РеквизитОбъект.ОбменДанными.Загрузка = Истина;
	РеквизитОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВМассивУдаленных(Ссылка)
	
	Если ТипЗнч(УдаленныеРеквизиты) = Тип("ФиксированныйМассив") Тогда
		МассивРеквизитов = Новый Массив(УдаленныеРеквизиты);
	Иначе
		МассивРеквизитов = Новый Массив;
	КонецЕсли;
	
	МассивРеквизитов.Добавить(Ссылка);
	УдаленныеРеквизиты = Новый ФиксированныйМассив(МассивРеквизитов);
	
КонецПроцедуры

&НаСервере
Функция НайтиРеквизит(Реквизит)
	
	СтруктураРеквизита = Новый Структура("Наименование, ТипЗначения");
	
	Реквизиты = РеквизитыДокумента.НайтиСтроки(Новый Структура("Ссылка", Реквизит));
	Если Реквизиты.Количество() = 1 Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Реквизиты[0]);
		Возврат СтруктураРеквизита;
	КонецЕсли;
		
	Реквизиты = РеквизитыСпискаСотрудников.НайтиСтроки(Новый Структура("Ссылка", Реквизит));
	Если Реквизиты.Количество() = 1 Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Реквизиты[0]);
	КонецЕсли;
		
	Возврат СтруктураРеквизита;
	
КонецФункции

&НаСервере
Процедура УстановитьРеквизитНесколькоСотрудников()
	
	Объект.НесколькоСотрудников = НесколькоСотрудников = 1;
		
КонецПроцедуры

#КонецОбласти
